아파트 실거래가와 인구밀도로 선형회귀 분석...

In [9]:
import pandas as pd

people_df = pd.read_csv('./전처리된_데이터_모음/서울인구_2023_2024_전처리후.csv', )

transaction_df = pd.read_csv('./전처리된_데이터_모음/아파트(매매)_실거래가_게약년월로_평균_거래금액_추출_2024년도.csv', )
# df.info()
# people_df.head()
people_df

    Unnamed: 0      기간       인구
0            0  202301  4447861
1            1  202302  4457982
2            2  202303  4463385
3            3  202304  4465391
4            4  202305  4467999
5            5  202306  4469158
6            6  202307  4471174
7            7  202308  4473734
8            8  202309  4475726
9            9  202310  4472603
10          10  202311  4469374
11          11  202312  4469417
12          12  202401  4471017
13          13  202402  4480607
14          14  202403  4485819
15          15  202404  4486137
16          16  202300  4469417

In [10]:
transaction_df.head()

     계약년월       거래금액_만원_
0  202401   95499.970916
1  202402   96461.290650
2  202403   99224.809488
3  202404  101950.664887
4  202405   99135.807712

In [7]:
transaction_df = transaction_df.rename(columns={'계약년월':'기간'})